[
    {
        "thread_url": "http://reddit.com/r/AskReddit/comments/vi6uoa/whats_your_scariest_camping_experience/",
        "thread_title": "What's your scariest camping experience?",
        "comments": [
            {
                "comment_body": "Went camping in deep Appalachia in a tent. Woke up to a weird feeling that I was laying on something. Then I felt it move. A snake had made its way under my tent and I think it was trying to get warm as it stopped moving right under where my back was.  After me moving a bit it finally went on its merry way. I'll never forget how it felt moving underneath me.",
                "comment_url": "/r/AskReddit/comments/vi6uoa/whats_your_scariest_camping_experience/idb8mwl/",
                "comment_id": "t1_idb8mwl"
            },
            {
                "comment_body": "I was pretty young, went camping with my dad in Alabama.  It’s late at night, the embers of the fire are dying down, we’re about to go to sleep, when we hear what I can only describe as a bone-chilling moan in the woods.\n\nWe looked at each other & decided it was trees rubbing together, but then it happened 2 more times.  My dad grabbed the flashlight & I walked behind him with a big stick, determined I would save him if something went wrong.\n\nEventually we discover a woman lying on the ground, not far from our campsite.  She was on a hill, with her head facing down, feet uphill, continuing to moan.\n\nTurns out she had so much to drink that she could hardly talk, but she was also camping out in these woods with her boyfriend.  They had a big fight & he drove away, leaving her alone in the forest.  She had seen our fire dying & wanted to give us the rest of her firewood before she left too, but had tripped & was too drunk to get up. We got her back to her campsite, & made sure she wasn’t driving anywhere that night.  I’ll never forget that moaning sound though.",
                "comment_url": "/r/AskReddit/comments/vi6uoa/whats_your_scariest_camping_experience/idcbr06/",
                "comment_id": "t1_idcbr06"
            },
            {
                "comment_body": "When I was 5ish I slept walked out my tent and off a small cliff in NC into a lake woke up down there then screamed until my parents found me",
                "comment_url": "/r/AskReddit/comments/vi6uoa/whats_your_scariest_camping_experience/idbp711/",
                "comment_id": "t1_idbp711"
            },
            {
                "comment_body": "Once in the wilderness me and a couple of other guys, drunk as we were, started howling at the moon only to inadvertently attract real wolves. They showed up at our camp site about 1½ hour later when we were in our hammocks getting ready to sleep. No harm done. They sniffed around for a couple of minutes and then went off. Guess they were disappointed in what they found and luckily not desperately hungry.  Anyways, I was very scared and tried to remain completely still and silent during this brief encounter.",
                "comment_url": "/r/AskReddit/comments/vi6uoa/whats_your_scariest_camping_experience/idc9k4d/",
                "comment_id": "t1_idc9k4d"
            },
            {
                "comment_body": "10 years ago I went camping for a weekend . Went out hiking  the morning of the second day and pretty soon found ourselves off trail on a pretty steep incline along the Monashee River. We were about 100 ft up the incline. Suddenly one of my friends lost his footing and started to slide. One the way down he took out my other friend and I watched them hit every rock and tree on the way down to the rapids. \n\nI climbed down to find my one friend dead on the side of the river, and the other taken away by the river. His body was found 2 weeks later 2 km from where they fell in. His body, or whatever is left of it, is still in the river because when Search and Rescue tried to remove it from the log jam it was stuck in, the boulders on the river bank came loose and collapsed on top of his corpse. \n\nThis was a very abbreviated version of the story, but overall a very scary day.",
                "comment_url": "/r/AskReddit/comments/vi6uoa/whats_your_scariest_camping_experience/idca9os/",
                "comment_id": "t1_idca9os"
            },
            {
                "comment_body": "Not really camping, but my first time out in the field at Ft Stewart, GA we had a small herd of about 10 wild boars go tearing through our bivouac area.  I didn't really realize how dangerous they were until I saw everyone hauling ass to their vehicles.  I hadn't been assigned a vehicle yet so I just monkey'd up a tree and waited while they tore into our rations, wrecked our tent, and then fucked off.  Took em about an hour to destroy thousands of dollars worth of equipment.",
                "comment_url": "/r/AskReddit/comments/vi6uoa/whats_your_scariest_camping_experience/idbenan/",
                "comment_id": "t1_idbenan"
            },
            {
                "comment_body": "Pretty sure two guys were going to rape my friend and me. \n\nWe were teenagers, 16 and 18, and went up alone. We made dinner and were having a a good time in the evening when some guy passed by our site in the river. He had a fishing pole, so we were like whatever. He asked to go through our site to the road and we figured it was harmless enough and said yeah. \n\nHe stopped and looked around our site and started asking us questions. How old are you? Where are you from? How long are you staying. Typical questions that were none of his business but we were naive enough to answer. He eventually leaves and heads down the canyon on the road.\n\nA couple hours later, he shows back up with a buddy. Both of these guys are middle aged, probably mid 40s. They start asking more questions. The original guy walks around and snoops about our campsite. We got an uneasy feeling and were super grateful when they eventually left. But they went up the canyon, rather than back where they came from. \n\nAnother couple hours pass and it's dark. My friend mentions how she can't hear anything because of the river and it had her a bit antsy. We talked and it turned out we had both been on edge since the guys left. We had never seen them go back down the canyon. \n\nWe both had a gut feeling that we needed to leave and FAST. Maybe nothing would have happened, but we both felt it. They guys asked all the right questions to know that we would be there alone and defenseless that night.",
                "comment_url": "/r/AskReddit/comments/vi6uoa/whats_your_scariest_camping_experience/idcfdw1/",
                "comment_id": "t1_idcfdw1"
            },
            {
                "comment_body": "Not camping, but in the woods...\n\nThis was while in the Army, doing squad maneuvers through the ass end of Fort Benning.  It had been raining most of the night, but nothing \"scary\". \n We were halted in a small clearing, surrounded by those giant-ass pine trees Georgia has everywhere.  All of a sudden. the wind started picking up, and strobe lightning was popping all around us.\n\nYou know those [wiggly guys](https://i.imgur.com/YKw9tlD.mp4)?  Well, the pine trees started doing shit like that.  I have never felt so small and completely at the will of nature as that night, and I've done solo open ocean sailing.\n\nThe next morning, they confirmed what we already know - we were danger-close to an F2 tornado.  There was one injury on another squad in our platoon, but otherwise the rest of us were unscathed.",
                "comment_url": "/r/AskReddit/comments/vi6uoa/whats_your_scariest_camping_experience/idbhlw1/",
                "comment_id": "t1_idbhlw1"
            },
            {
                "comment_body": "Late at night camping in the desert, heard footsteps all around our tents. Thought it was maybe some drunk guy from one of the nearby camps who was riding dirt bikes and stuff all day.\n\nCouldn't see anyone. Couldn't see any shadows. Kept hearing the footsteps, literally inches from our tent. Woke up my friend silently and made him listen too, we were freaking out.\n\nFinally they went away, so I slowly opened my tent zipper to look around and see who/what it was.\n\nThrew out a glowstick, and saw some eyes flash in the darkness\n\n\nTurns out it was 2 white desert foxes, whose footsteps were somehow extremely heavy sounding. When I saw them they were on our camp table, eating all of our chocolate.\n\nOops",
                "comment_url": "/r/AskReddit/comments/vi6uoa/whats_your_scariest_camping_experience/idbalye/",
                "comment_id": "t1_idbalye"
            },
            {
                "comment_body": "Thought our tent was being attacked by 3 bears. Turns out someone's dogs just got loose and the light outside made them look gigantic.",
                "comment_url": "/r/AskReddit/comments/vi6uoa/whats_your_scariest_camping_experience/idbo2xi/",
                "comment_id": "t1_idbo2xi"
            }
        ]
    },
    {
        "thread_url": "http://reddit.com/r/AskReddit/comments/vhzoyr/what_are_some_very_comforting_facts/",
        "thread_title": "What are some VERY comforting facts?",
        "comments": [
            {
                "comment_body": "The ozone layer is slowly repairing itself",
                "comment_url": "/r/AskReddit/comments/vhzoyr/what_are_some_very_comforting_facts/idc00o6/",
                "comment_id": "t1_idc00o6"
            },
            {
                "comment_body": "some fish like to be pet",
                "comment_url": "/r/AskReddit/comments/vhzoyr/what_are_some_very_comforting_facts/idawt5k/",
                "comment_id": "t1_idawt5k"
            },
            {
                "comment_body": "Zebras rest with their heads on each other’s backs so they can literally watch their zebra buddy’s back. Plus it looks like a zebra hug.",
                "comment_url": "/r/AskReddit/comments/vhzoyr/what_are_some_very_comforting_facts/idbqomn/",
                "comment_id": "t1_idbqomn"
            },
            {
                "comment_body": "Monarch butterfly populations are doing better. Not out of the dark, but better. I found a monarch caterpillar on my milkweed the other day.",
                "comment_url": "/r/AskReddit/comments/vhzoyr/what_are_some_very_comforting_facts/idal42x/",
                "comment_id": "t1_idal42x"
            },
            {
                "comment_body": "Humans can hear each other smile through the phone through differentiating vocal intonation between smiles and non-smiles.\n\n[https://www.npr.org/templates/story/story.php?storyId=18255131](https://www.npr.org/templates/story/story.php?storyId=18255131)\n\n[https://hyken.com/customer-experience-2/guest-blog-smile-customers-phone/](https://hyken.com/customer-experience-2/guest-blog-smile-customers-phone/)",
                "comment_url": "/r/AskReddit/comments/vhzoyr/what_are_some_very_comforting_facts/idb6r1v/",
                "comment_id": "t1_idb6r1v"
            },
            {
                "comment_body": "This past year there has been a massive breakthrough on SIDS research. Meaning in the future we may be able to detect SIDS in infants and possibly avoid as many infant deaths.",
                "comment_url": "/r/AskReddit/comments/vhzoyr/what_are_some_very_comforting_facts/idbsbyl/",
                "comment_id": "t1_idbsbyl"
            },
            {
                "comment_body": "Swedish blood donors receive a text whenever their blood is used to help someone.",
                "comment_url": "/r/AskReddit/comments/vhzoyr/what_are_some_very_comforting_facts/idbcefh/",
                "comment_id": "t1_idbcefh"
            },
            {
                "comment_body": "Your pets will forgive you if you accidentally step on them",
                "comment_url": "/r/AskReddit/comments/vhzoyr/what_are_some_very_comforting_facts/idaws3d/",
                "comment_id": "t1_idaws3d"
            },
            {
                "comment_body": "\nSwitzerland has implemented a scheme ‘Time Bank’; which is an old-age assistance programme, under which, people can volunteer to look after the elderly who require assistance, and then, the number of hours they spend with or caring for seniors gets deposited in their individual social security account.Eventually, when the volunteer reaches that old age when he or she requires support, this ‘Time Bank’ can help them by providing time-based services which include consultations, babysitting, hairdressing, gardening, tutoring, or any other time-consuming job in addition to being looked after by a volunteer as well.About 34 countries are trying to apply this scheme. \n\nVery Wholesome and humane!",
                "comment_url": "/r/AskReddit/comments/vhzoyr/what_are_some_very_comforting_facts/idc4gls/",
                "comment_id": "t1_idc4gls"
            },
            {
                "comment_body": "There is a type of mold growing on/around the Elephant's Foot in Chernobyl. This mold eats radiation, and the radioactivity of the Elephant's Foot has decreased drastically since the mold started growing there. idk, it's just comforting to me that the planet can heal no matter how bad the scar we left.",
                "comment_url": "/r/AskReddit/comments/vhzoyr/what_are_some_very_comforting_facts/idccdtx/",
                "comment_id": "t1_idccdtx"
            }
        ]
    },
    {
        "thread_url": "http://reddit.com/r/AskReddit/comments/vhxxwm/if_heaven_exists_whats_the_first_thing_youd_do/",
        "thread_title": "If heaven exists, what’s the first thing you’d do?",
        "comments": [
            {
                "comment_body": "Ask my childhood friend Kevon for a race. He used to beat me handily when were younger (9-13) and he’d always brag. when I got older and faster I moved away so I was never able to race him again. We arranged for a race but he was shot multiple times and bound to a wheelchair until he passed a few years ago. I wanna race him both in our prime.",
                "comment_url": "/r/AskReddit/comments/vhxxwm/if_heaven_exists_whats_the_first_thing_youd_do/ida8kuo/",
                "comment_id": "t1_ida8kuo"
            },
            {
                "comment_body": "Find my husband, give him a huge hug and never let go again. Live our forever together. I fucking love him and miss him so much.",
                "comment_url": "/r/AskReddit/comments/vhxxwm/if_heaven_exists_whats_the_first_thing_youd_do/idacbn9/",
                "comment_id": "t1_idacbn9"
            },
            {
                "comment_body": "Embrace my sweet wife and tell her how proud I am of the kids.",
                "comment_url": "/r/AskReddit/comments/vhxxwm/if_heaven_exists_whats_the_first_thing_youd_do/idaezoj/",
                "comment_id": "t1_idaezoj"
            },
            {
                "comment_body": "Try to find my brother. Man, I miss him. He died in 2020 at age 34.",
                "comment_url": "/r/AskReddit/comments/vhxxwm/if_heaven_exists_whats_the_first_thing_youd_do/idajked/",
                "comment_id": "t1_idajked"
            },
            {
                "comment_body": "Find my son and have a beer with him. Something we never got to do in real life.",
                "comment_url": "/r/AskReddit/comments/vhxxwm/if_heaven_exists_whats_the_first_thing_youd_do/idaw0dm/",
                "comment_id": "t1_idaw0dm"
            },
            {
                "comment_body": "Enjoy my healthy back wirhout pain",
                "comment_url": "/r/AskReddit/comments/vhxxwm/if_heaven_exists_whats_the_first_thing_youd_do/ida66ts/",
                "comment_id": "t1_ida66ts"
            },
            {
                "comment_body": "Try to play Smoke on the water on my harp.",
                "comment_url": "/r/AskReddit/comments/vhxxwm/if_heaven_exists_whats_the_first_thing_youd_do/id9zgk6/",
                "comment_id": "t1_id9zgk6"
            },
            {
                "comment_body": "#Rest.",
                "comment_url": "/r/AskReddit/comments/vhxxwm/if_heaven_exists_whats_the_first_thing_youd_do/id9voy3/",
                "comment_id": "t1_id9voy3"
            },
            {
                "comment_body": "Give my mum and dad a big hug",
                "comment_url": "/r/AskReddit/comments/vhxxwm/if_heaven_exists_whats_the_first_thing_youd_do/id9xj2k/",
                "comment_id": "t1_id9xj2k"
            },
            {
                "comment_body": "Meet Garrus at the bar for a drink.",
                "comment_url": "/r/AskReddit/comments/vhxxwm/if_heaven_exists_whats_the_first_thing_youd_do/idafori/",
                "comment_id": "t1_idafori"
            }
        ]
    },
    {
        "thread_url": "http://reddit.com/r/AskReddit/comments/vi17s9/what_pisses_you_off_instantly/",
        "thread_title": "What pisses you off instantly?",
        "comments": [
            {
                "comment_body": "Getting blamed for something you didn’t do.",
                "comment_url": "/r/AskReddit/comments/vi17s9/what_pisses_you_off_instantly/idak6g6/",
                "comment_id": "t1_idak6g6"
            },
            {
                "comment_body": "Giant sink bowls but tiny faucets that make your hands touch the back of it. WHAT WAS THE POINT OF THE BIG ASS SINK BOWL",
                "comment_url": "/r/AskReddit/comments/vi17s9/what_pisses_you_off_instantly/idaj5hs/",
                "comment_id": "t1_idaj5hs"
            },
            {
                "comment_body": "When someone tells me to do something I am already doing.",
                "comment_url": "/r/AskReddit/comments/vi17s9/what_pisses_you_off_instantly/idadmuk/",
                "comment_id": "t1_idadmuk"
            },
            {
                "comment_body": "Earbuds being ripped from your ear when the cord gets caught on something",
                "comment_url": "/r/AskReddit/comments/vi17s9/what_pisses_you_off_instantly/idbbxtk/",
                "comment_id": "t1_idbbxtk"
            },
            {
                "comment_body": "People who don't let others OFF things (elevators, subways, etc.) ...while they try to get on.",
                "comment_url": "/r/AskReddit/comments/vi17s9/what_pisses_you_off_instantly/idabpfc/",
                "comment_id": "t1_idabpfc"
            },
            {
                "comment_body": "People who claim credit for someone else's work",
                "comment_url": "/r/AskReddit/comments/vi17s9/what_pisses_you_off_instantly/idaogow/",
                "comment_id": "t1_idaogow"
            },
            {
                "comment_body": "When people are walking slowly or stopping directly in front of me.",
                "comment_url": "/r/AskReddit/comments/vi17s9/what_pisses_you_off_instantly/idacl33/",
                "comment_id": "t1_idacl33"
            },
            {
                "comment_body": "Famous people getting away with stuff that I would go to prison for.",
                "comment_url": "/r/AskReddit/comments/vi17s9/what_pisses_you_off_instantly/idahusw/",
                "comment_id": "t1_idahusw"
            },
            {
                "comment_body": "Ever caught your belt loop on a door handle???",
                "comment_url": "/r/AskReddit/comments/vi17s9/what_pisses_you_off_instantly/idahei0/",
                "comment_id": "t1_idahei0"
            },
            {
                "comment_body": "People that always compete achievements everytime they are mentioned. I might be saying this wrong",
                "comment_url": "/r/AskReddit/comments/vi17s9/what_pisses_you_off_instantly/idaesga/",
                "comment_id": "t1_idaesga"
            }
        ]
    },
    {
        "thread_url": "http://reddit.com/r/AskReddit/comments/vi5tiy/gamers_of_reddit_what_are_some_unwritten_rules_of/",
        "thread_title": "gamers of reddit what are some unwritten rules of video games?",
        "comments": [
            {
                "comment_body": "Save. No, again.",
                "comment_url": "/r/AskReddit/comments/vi5tiy/gamers_of_reddit_what_are_some_unwritten_rules_of/idazle7/",
                "comment_id": "t1_idazle7"
            },
            {
                "comment_body": "Barrels explode.\n\nPots can be broken for money.\n\nIf you find a room with many healing potions, SAVE.",
                "comment_url": "/r/AskReddit/comments/vi5tiy/gamers_of_reddit_what_are_some_unwritten_rules_of/idb1yxb/",
                "comment_id": "t1_idb1yxb"
            },
            {
                "comment_body": "You must jump into portals, not walk, not run... ***jump!!***",
                "comment_url": "/r/AskReddit/comments/vi5tiy/gamers_of_reddit_what_are_some_unwritten_rules_of/idazhba/",
                "comment_id": "t1_idazhba"
            },
            {
                "comment_body": "Don't snipe your dad in the back of the head after he spent your early years teaching you how to play. Although I am secretly proud.",
                "comment_url": "/r/AskReddit/comments/vi5tiy/gamers_of_reddit_what_are_some_unwritten_rules_of/idb21qs/",
                "comment_id": "t1_idb21qs"
            },
            {
                "comment_body": "When there's a fire, walk through it to see if it damages you.",
                "comment_url": "/r/AskReddit/comments/vi5tiy/gamers_of_reddit_what_are_some_unwritten_rules_of/idb6fy3/",
                "comment_id": "t1_idb6fy3"
            },
            {
                "comment_body": "If you're about to start a new game+. Kill every npc that you can, and take their loot first.",
                "comment_url": "/r/AskReddit/comments/vi5tiy/gamers_of_reddit_what_are_some_unwritten_rules_of/idb4d9b/",
                "comment_id": "t1_idb4d9b"
            },
            {
                "comment_body": "Always check behind the Waterfall. If there's loot, be disappointed that it wasn't creative enough. If there's no loot, how dare they? It's a waterfall!",
                "comment_url": "/r/AskReddit/comments/vi5tiy/gamers_of_reddit_what_are_some_unwritten_rules_of/idbaiga/",
                "comment_id": "t1_idbaiga"
            },
            {
                "comment_body": "Save your grenades and healing items 'just in case'.  You should finish the game with a few hundred of each.\n\nJump is always 'A' on Xbox or 'X' on PS.  Unless it isn't in which case you're going to do a lot of reloading instead of jumping.\n\nYou can run faster if you put your rocket launcher in your pocket and pull out your knife instead.",
                "comment_url": "/r/AskReddit/comments/vi5tiy/gamers_of_reddit_what_are_some_unwritten_rules_of/idbb03x/",
                "comment_id": "t1_idbb03x"
            },
            {
                "comment_body": "When you crouch a few times really fast it means you are friendly, but if you crouch real fast after killing someone you are tea bagging",
                "comment_url": "/r/AskReddit/comments/vi5tiy/gamers_of_reddit_what_are_some_unwritten_rules_of/idazox6/",
                "comment_id": "t1_idazox6"
            },
            {
                "comment_body": "You shoot one bullet, better reload.",
                "comment_url": "/r/AskReddit/comments/vi5tiy/gamers_of_reddit_what_are_some_unwritten_rules_of/idb3vll/",
                "comment_id": "t1_idb3vll"
            }
        ]
    }
]