[
    {
        "thread_url": "http://reddit.com/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/",
        "thread_title": "What improved your life so much, you wished you did sooner?",
        "comments": [
            {
                "comment_body": "When I was told that I would lose my eyesight it made me pay more attention to how beautiful the sky was. I can still see and I enjoy watching the clouds on a level I can't even explain.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id8bzzz/",
                "comment_id": "id8bzzz"
            },
            {
                "comment_body": "Low impact cardio. \n\nFuck I loved to run, but it destroyed my legs. \n\nI can swim 🏊‍♂️ my little heart out :)",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id8c6vk/",
                "comment_id": "id8c6vk"
            },
            {
                "comment_body": "Daily exercise. It doubled my energy for an hour out of my day.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id84weo/",
                "comment_id": "id84weo"
            },
            {
                "comment_body": "Bachelor degree at 47 years old. Master degree at 50 years old. \n\nDoubled my salary in 4 years, from just getting by to on track for retiring at 60.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id8q91k/",
                "comment_id": "id8q91k"
            },
            {
                "comment_body": "Doing at least one chore a day.\n\nYou would be amazed at how well getting *something* done, even if you hate it, can fight back against certain depressive mentalities, particularly the ones that convince you you're useless or are a burden.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id7uk2a/",
                "comment_id": "id7uk2a"
            },
            {
                "comment_body": "Moved away from the state I grew up in.  I didn't know how unhappy I was.  I had gotten used to being miserable and now that I'm in a better area I'm a completely different person.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id7vtco/",
                "comment_id": "id7vtco"
            },
            {
                "comment_body": "Exercise every day. Anxiety and depression are much easier to manage, and I got some confidence I haven't had in years",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id8f23o/",
                "comment_id": "id8f23o"
            },
            {
                "comment_body": "Learning to set boundaries and say no",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id87l8u/",
                "comment_id": "id87l8u"
            },
            {
                "comment_body": "I started flower gardening.  Really relaxing,  you will see results all summer,  lots of sucesses and failures but failures bring improvements.  And I listen to audible books while I'm at it sometimes.  Especially great if you have a desk job.\n\nEdit: It's so nice to know so many are enjoying gardening! I had no idea it would be a reddit thing.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id7s4w0/",
                "comment_id": "id7s4w0"
            },
            {
                "comment_body": "Quitting drinking is the best thing I’ve ever done for my mental and physical health and it’s done nothing but improve my relationships. The last year and a half have been the best I’ve ever had",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id80ohv/",
                "comment_id": "id80ohv"
            },
            {
                "comment_body": "My social skills. Looking back, I could have made some awesome new friends. But nope, my anxiety driven ass had to be difficult back then.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id7xd3n/",
                "comment_id": "id7xd3n"
            },
            {
                "comment_body": "Quitting smoking.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id7pbe8/",
                "comment_id": "id7pbe8"
            },
            {
                "comment_body": "Stopped arguing with random strangers on internet.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id7uxrs/",
                "comment_id": "id7uxrs"
            },
            {
                "comment_body": "Reading books way more",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id7xbxm/",
                "comment_id": "id7xbxm"
            },
            {
                "comment_body": "Finally talking with my (then-new) family doctor about my misuse of decongestant nose spray. He told me it's a common issue and that there is help. 1.5 years of tapering off and two surgeries later I used bad nosespray for the final time. I could kick myself for not talking about it for more than twenty years.\n\nEdit: I am working my way through the comments and questions, I posted it before going to bed and didn't expect much reaction, so:\n\nThe addiction's name is Rhinitis medicamentosa. So it's not an addiction like alcohol (in the way there's a \"reward\" system in your brain), but it's a self sustaining process - you have an infection and take nose spray. If you do it more than a few days the reason why you took it at first is gone, but these sprays mean the nose clogs again. So you take nose spray against nose spray, which got worse and worse over the years.\n\nMany asked which spray I took: I largely gave up talking about any names in this regard - by definition of stereotype every redditor except me is from the US, so your stuff has different names in the store than the German stuff I took. \n\nThe nose spray I used is sold in Germany as Nasic which has xylometazoline as main active agent.\n\nSome others asked about the surgeries, so here is more about the process: \nMy new family doctor sent me to an ENT for help. He mentioned that next to the effect of the addiction, there's often a background to it. Turned out my concha were enlarged and my septum deviated. I must have broken my nose once, the ENT insisted ot must have happened although I didn't know it. Maybe when I fell off my bike as toddler or so. Both limited how much air could pass and made it even more prone to clogging, which was boosted by the misuse of Nasic. \n\nThe concha were cauterized (so a small intervention, about 30 minutes + a few days sick leave), the septum deviation was corrected via full anaesthesia surgery in the hospital by the ENT + 2 weeks sick leave\n\nThe process took so long as the ENT started with tapering off by flooding the nose spray with hayfever and sea salt ones, (effect: Reducing bad nose spray from 5x a day to 1-2x), then cauterizing after which the nose needed to heal (reducing it to 0-1x per day) before the surgery. As the septum deviation is done in hospital I needed to wait a few weeks until I could do it, and afterwards the nose needs some weeks to heal again.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id7st3c/",
                "comment_id": "id7st3c"
            },
            {
                "comment_body": "Eating dinner or a late snack at work. Too often I would leave work hungry, and the temptation driving past Chick-fil-A or the corner taco shop was too much. I've kept my weight under control for a couple of years now, having dropped from the 220s to the 170s.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id80pfq/",
                "comment_id": "id80pfq"
            },
            {
                "comment_body": "I started viewing things as potential experiences rather than just opportunities for achievement.\n\nBefore that, for example, if I took a class then I was only focused on the grade. If I couldn't get a good grade, I didn't like the class. Heck, I wouldn't even start a book if I thought it might be too hard or too long and I might not finish it.\n\nThen I realized the purpose of classes (and books and other things) was to learn and that hard ones were likely the ones I learned the most from, even if I didn't get the best grade.\n\nI started doing all sorts of stuff with the idea that I just wanted the experience. Even if I was the worst one out there, who cares? I wasn't there for the achievement, I wanted to learn things.\n\nThis works socially as well and I started taking way more risks, telling myself that, at the very least, it would be a learning experience.\n\nI saw a saying once: \"It's only a failure if you stop trying, otherwise, it's an experiment.\" I love it.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id82l8r/",
                "comment_id": "id82l8r"
            },
            {
                "comment_body": "Stopped caring what others think about me.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id7tdqv/",
                "comment_id": "id7tdqv"
            },
            {
                "comment_body": "Eating more healthily.\n\nEdited: Getting a lot of questions about how I did it. Here's some suggestions with the reminder that this works for me, may not work for you. If you REALLY are serious about losing weight, consult a doctor and/or nutritionist.\n\n1) I was a carb fiend. Pasta, rice, bread, if it had a carb, I wanted fourth servings of it. Sugar is a carb too. So I started watching how many carbs I consumed a day. It shocked me. So now I'm a lot more aware of how many carbs I eat. \n\n2) Building on number 1, serving sizes. To me, an open container of any size was a single serving. I pay attention to how much I'm supposed to eat. For snacks, I'm addicted to SmartFood. You can order a bunch of them in single serving sizes. \n\n3) Vegetables. I always ate veggies, now I eat more. What used to be two thirds potatoes or pasta or rice with a meal is now two thirds vegetables.\n\n4) Cut back on meat. We usually go meatless for dinner at least twice a week. I hardly eat it at breakfast and lunch is about 50/50. I'd say 90% of the meat we do eat is chicken or fish. \n\n5) I have always LOVED to cook but now I'm really stretching my wings and trying things I wouldn't do before. If you don't know how to cook, LEARN. Alton Brown or Ina Garten are great starting places. Don't be intimidated by it, you're not working for Gordon Ramsay, you're just feeding yourself. Learn spices. Steaming veggies sucks. Roast that shit. Stir fry that shit. Eat it raw. Anything but steaming. Except boiling, that's worse. \n\n6) Bring your lunch to work. If you eat breakfast at work, bring that too. Same with snacks unless you can get healthy ones there. \n\n7) Don't beat yourself up if you have a cheeseburger. You ARE going to fail. I fail all the time. Every day is a new start. \n\n8) We only eat out or order out once a week. \n\n9) Water. More than you think. Learn to love to pee. \n\n10) I can't do this right now because I broke my foot but a walk after every meal helps with your blood sugar. Ten minutes after breakfast and lunch, a half hour after dinner.\n\n11) All things in moderation. You can have butter or cheese or fried foods, just not every meal. And keep to what you're supposed to eat, it's a lot smaller than you think.\n\nAnyway, that's some of the stuff that *I* personally did. It worked for me, it may not work for you. I'm not a dietician, just a dude who wanted to lose some weight.",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id7r5lz/",
                "comment_id": "id7r5lz"
            },
            {
                "comment_body": "listening to the sound of rain to fall asleep",
                "comment_url": "/r/AskReddit/comments/vhki66/what_improved_your_life_so_much_you_wished_you/id7qa1i/",
                "comment_id": "id7qa1i"
            }
        ]
    },
    {
        "thread_url": "http://reddit.com/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/",
        "thread_title": "what is proven to be a hoax but people still believe it to be true?",
        "comments": [
            {
                "comment_body": "Touching a baby bird will make its parents reject it.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8otu5/",
                "comment_id": "id8otu5"
            },
            {
                "comment_body": "We only use 10% or our brain.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8mzj5/",
                "comment_id": "id8mzj5"
            },
            {
                "comment_body": "That cracking your knuckles gives you arthritis",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8t3gw/",
                "comment_id": "id8t3gw"
            },
            {
                "comment_body": "That you swallow 8 spiders a year in your sleep.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8konm/",
                "comment_id": "id8konm"
            },
            {
                "comment_body": "Lie detectors",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8p96v/",
                "comment_id": "id8p96v"
            },
            {
                "comment_body": "Shaving making hair grow in thicker.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8kc0j/",
                "comment_id": "id8kc0j"
            },
            {
                "comment_body": "It’s illegal to keep the light on in the car while driving.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8szgu/",
                "comment_id": "id8szgu"
            },
            {
                "comment_body": "The food pyramid.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id88pe9/",
                "comment_id": "id88pe9"
            },
            {
                "comment_body": "Professional fighters don't actually have to register their hands as weapons. No body part can be registered as a weapon.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8sbdn/",
                "comment_id": "id8sbdn"
            },
            {
                "comment_body": "MLMs, Boss babes, \"be your own boss\" scams.\n\nI'm not sure how many documentaries need to be put on YouTube before people will stop buying into these companies and wasting their money.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8jpf0/",
                "comment_id": "id8jpf0"
            },
            {
                "comment_body": "People putting needles or poison in Halloween candy.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8cpaa/",
                "comment_id": "id8cpaa"
            },
            {
                "comment_body": "Blood in your veins is blue and red in your arteries. Literally every elementary school teacher I had kept this lie going.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8kmgg/",
                "comment_id": "id8kmgg"
            },
            {
                "comment_body": "If you pull out a grey hair three more grow in its place, my sister still believes this one.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8xvse/",
                "comment_id": "id8xvse"
            },
            {
                "comment_body": "Avril Lavigne is in fact, not dead.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id89dxf/",
                "comment_id": "id89dxf"
            },
            {
                "comment_body": "Wolf hierarchy with alpha on top and omega at the bottom",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id899t0/",
                "comment_id": "id899t0"
            },
            {
                "comment_body": "hot singles in my area\n\nedit: misread this, may or may not be high af and or blind",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8qh69/",
                "comment_id": "id8qh69"
            },
            {
                "comment_body": "Homeopathy. It's water.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8l2rh/",
                "comment_id": "id8l2rh"
            },
            {
                "comment_body": "The earth being flat. We have literally done studies, taken pictures, boiled all of that down to the level that a kindergartener can understand it, and some idiots still don't get it.",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id89np7/",
                "comment_id": "id89np7"
            },
            {
                "comment_body": "That MSG is bad for you.\n\nI meet people regularly that think it's a super insta-cancer ingredient that will cause you to die or something based on 80s/90s false scares. Then I tell them \"you do know it naturally occurs on tomatoes, yes?\"",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8myof/",
                "comment_id": "id8myof"
            },
            {
                "comment_body": "That Australia is a hoax created by NASA and everyone living there are paid actors",
                "comment_url": "/r/AskReddit/comments/vhnoz7/what_is_proven_to_be_a_hoax_but_people_still/id8mu5a/",
                "comment_id": "id8mu5a"
            }
        ]
    },
    {
        "thread_url": "http://reddit.com/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/",
        "thread_title": "What’s your favourite thing to touch?",
        "comments": [
            {
                "comment_body": "Those **extremely** soft blankets that you find at Target. You know the kind I'm talkin' about. \nMy cat & I both love to \"knead\" them, it's nice quality time.",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8vdt7/",
                "comment_id": "id8vdt7"
            },
            {
                "comment_body": "My computer mouse",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8hzhv/",
                "comment_id": "id8hzhv"
            },
            {
                "comment_body": "Cold, fresh bed sheets after a hot shower",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8h76i/",
                "comment_id": "id8h76i"
            },
            {
                "comment_body": "Rubbing your hand across buzzed hair is pretty cool, it just ripples with little cool hair sharpness",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8lnzh/",
                "comment_id": "id8lnzh"
            },
            {
                "comment_body": "My dogs ears, they’re soft and velvety and he loves it and snugs into me so it’s win-win",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8j6cw/",
                "comment_id": "id8j6cw"
            },
            {
                "comment_body": "My cat",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8lztw/",
                "comment_id": "id8lztw"
            },
            {
                "comment_body": "Velvet. I’d drape myself in velvet if it was socially acceptable",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8qc0f/",
                "comment_id": "id8qc0f"
            },
            {
                "comment_body": "My dog for the 15 minutes he lasts clean and soft right after a bath, before he finds a dirt patch to roll over.",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8jxrb/",
                "comment_id": "id8jxrb"
            },
            {
                "comment_body": "a cold pillow",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8np7b/",
                "comment_id": "id8np7b"
            },
            {
                "comment_body": "Pulling warm clothes out of the dryer, especially since they smell so good. Occasionally, if I’m pulling out a sweater or something, I’ll immediately put it on, just to feel the warmth. Also dress copies of paper. They come out all warm.",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8pp8m/",
                "comment_id": "id8pp8m"
            },
            {
                "comment_body": "Boobies.",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8heop/",
                "comment_id": "id8heop"
            },
            {
                "comment_body": "Cat toe beans",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8oqpq/",
                "comment_id": "id8oqpq"
            },
            {
                "comment_body": "My ankles",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8gysh/",
                "comment_id": "id8gysh"
            },
            {
                "comment_body": "Mine have to be sand maybe. Warm and fine sand",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8hp84/",
                "comment_id": "id8hp84"
            },
            {
                "comment_body": "I live in an old house (1896). At the top of the steps to the 2nd level bedrooms, on the outside of the rail, the square nail head sticks out proud about an 1/8”.  House has moved over the last 120 years. Still solid. \n\nI don’t open the kids gate without touching that nail head with my middle finger.  It’s my houses promise that it won’t fall down in the middle of the night and I can see my kids in the morning. It’s my favorite thing to touch.",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8s926/",
                "comment_id": "id8s926"
            },
            {
                "comment_body": "To summarise responses to this post:\n1. Boobies\n2. Dog’s velvety ears",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id9alq8/",
                "comment_id": "id9alq8"
            },
            {
                "comment_body": "Ass",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8h3eo/",
                "comment_id": "id8h3eo"
            },
            {
                "comment_body": "My nutsack",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8hgrr/",
                "comment_id": "id8hgrr"
            },
            {
                "comment_body": "My boobs, it's almost like a comfort thing. I've had to stop myself from holding them in public sometimes.",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8myl4/",
                "comment_id": "id8myl4"
            },
            {
                "comment_body": "Deflating risen dough. It’s soft and squishy.",
                "comment_url": "/r/AskReddit/comments/vhpf8l/whats_your_favourite_thing_to_touch/id8t2zo/",
                "comment_id": "id8t2zo"
            }
        ]
    },
    {
        "thread_url": "http://reddit.com/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/",
        "thread_title": "What was “the big rumour “in your high school, did turn out to be true?",
        "comments": [
            {
                "comment_body": "\"Dr\" Palermo the band teacher never received his doctorate in music like he claimed. It was weird, he use to force all his students to address him as \"Dr\" but when he came back from his leave of absence we all called him by \"Mr\" like nothing happened.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id81ny5/",
                "comment_id": "id81ny5"
            },
            {
                "comment_body": "That one of the English teachers used to physically assault kids. No one believed it because he was elderly and very kind. One day he told our class that back in the 80s when he was teaching any time a kid got mouthy or started a fight in his classroom he would pick them up physically and throw them out of his class. He gave a kid a concussion once because he bounced his head off a locker. They sent him to anger management classes but he stayed teaching at the school until his retirement",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id84wz6/",
                "comment_id": "id84wz6"
            },
            {
                "comment_body": "There was an 18-year-old freshman who was pregnant, and there was a joke spread that this was her 4th kid. They said she was first pregnant at 12 years old and that was why she never finished 9th grade.\n\nI actually made friends with her because we both walked the mile in PE, and I felt bad that people were spreading this rumor and making fun of someone who obviously is trying to better themselves for their baby.\n\nWell, turns out, it was actually her 5th kid. She had one set of twins at the age of 13. Then at 14 she was trying to be a mother of 2 and finish 9th grade, but she got pregnant again and dropped out. I realize now that the entire situation was very concerning. I hope she got some guidance.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id80odq/",
                "comment_id": "id80odq"
            },
            {
                "comment_body": "That the English teacher had been sleeping with students. I found out when I was a freshman in 2008. Fast forward 8 years later, the chemistry teacher got caught and decided to bring the English teacher down with him to get some heat off his back. A total of three teachers went to jail.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id7x8l3/",
                "comment_id": "id7x8l3"
            },
            {
                "comment_body": "Not nearly as exciting as some of the replies, but at my old high school I was always told that if you go to school after dark, in certain conditions youd see a bunch of swastikas painted on the brick walls of the building. I thought it was fake bc \"if theyre really painted on there why cant you see them at all times\". \n\nOne night I stayed late for an art club meeting. We were studying photo exposure and playing with some light tubes to make cool pictures, so we were having the meeting outside in the dark.\n\nAs we were messing around I approached the building from a certain angle and saw them. Idk if it was spray paint that got scrubbed off and left some kind of residue/chemical on the bricks, or if someone sprayed them with clear coat or something, but there were very obviously swastikas on the wall",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id84ygz/",
                "comment_id": "id84ygz"
            },
            {
                "comment_body": "At my high school two kids who were cousins were dating. They always denied it but a lot of people still believed it. They did look weirdly similar, but a lot of people just chalked it up to coincidence.\n\nAbout a year later they broke up and totally stopped interacting. Rumors started that their parents got involved or found out and shut it down, and it was again left to speculation.\n\nAt our five year reunion somebody who knew their family said that it turned out the rumor about them being cousins wasn't true. They were half siblings and didn't even know until their parents put it together one day.\n\nSo kind of true?",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id83pxg/",
                "comment_id": "id83pxg"
            },
            {
                "comment_body": "On a ski trip the Phys Ed teacher allegedly porked the science teacher. Someone saw him go in to her room in the middle of the night. They denied it but years later they got married.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id73por/",
                "comment_id": "id73por"
            },
            {
                "comment_body": "That an english teacher was using heroin. It’s pretty sad actually. He was just a regular guy who destroyed his knee. So after surgery he got painkillers, got hooked on them, and then eventually started using heroin. \n\nNobody really believed it until he abruptly went on leave. He was gone for most of the school year and when he eventually got sober and came back, he told his story to the students to try to show them how dangerous that stuff is, and confirmed everything to be true.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id7ifhc/",
                "comment_id": "id7ifhc"
            },
            {
                "comment_body": "The biggest rumor in my high school was that one of the science teachers/baseball coach was banging the health teacher/volleyball coach.  He was at every volleyball game, she came to most of the baseball games.  People would say they saw his truck at her apartment complex, somebody said they saw them together at a concert 200 miles from home.  Both of them constantly got asked if they were messing around on their boyfriend/girlfriend with each other and both denied it for the entire year.\n\nYeah, turned out they'd been dating for three years like adults can do and just kept it a secret from students because high school students suck.  They got married the summer after I graduated.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id7ymkb/",
                "comment_id": "id7ymkb"
            },
            {
                "comment_body": "There were rumors for years about some of the younger male teachers and female students. Some of the teachers ended up leaving never to be spoken of again, others stuck around, but nothing was ever substantiated. Then while my class was on our senior trip, the music teacher got arrested. Then two more teachers the following year. Then several years went by and the school abruptly announced it was shutting down for \"financial reasons\" two weeks before the end of the school year. The week after it closed for good, another teacher got arrested.\n\nSo yeah, I'd say the rumors turned out to be true.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id7wcxp/",
                "comment_id": "id7wcxp"
            },
            {
                "comment_body": "That one of the gym teachers (very large lady) broke the diving board every year. I didn't have her class but from what I understood it was true except it only happened once.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id7c49d/",
                "comment_id": "id7c49d"
            },
            {
                "comment_body": "That a teacher was sleeping with students. Turned out to be the AP US History teacher. He was caught, and later fired.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id772nu/",
                "comment_id": "id772nu"
            },
            {
                "comment_body": "The softball coach in his 40s was dating one of his players. It turned out to be a sophomore, so she was 15/16 at the time. He left his wife and kids for her, but she soon realized he was a creep and ended things. His “punishment” was a one-year suspension from coaching, but kept his teaching job somehow.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id7otv3/",
                "comment_id": "id7otv3"
            },
            {
                "comment_body": "The BIG RUMOR wasn't about my high school but a school on the east side of town. \n\nThe rumor was, a bunch of girls were running a prostitution ring out of the school. \n\nIt turns out it was true! PD went undercover and busted about a dozen girls.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id7fggn/",
                "comment_id": "id7fggn"
            },
            {
                "comment_body": "That our science teacher was kind of a creep. I always thought he was nice! Years later he was fired and arrested for aggravated child porn.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id79sed/",
                "comment_id": "id79sed"
            },
            {
                "comment_body": "That there was an orgy several weekends involving a dozen students and at least a dozen adults (age of consent way back then was 16).  A bunch of the \"cool kids\" spent a lot of the summer at the lake cabin somebody's parents owned.  The lake house next door was owned by a couple who would host swinging weekends there.  At some point the two groups started hanging out together because high school kids love free alcohol and eventually the students started staying for the orgies.  That rumor BLEW UP my entire senior year and the longer it went the more it got to be obvious something had happened, then it was obvious what had happened.  (this was back in the late 1980's with the Aids scare and anti-gay paranoia).  The whole story came out in a drunken argument by two of the girls involved.  The reason it had been kept secret for so long was that everyone involved had hooked up with the same sex at some point.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id7xqlg/",
                "comment_id": "id7xqlg"
            },
            {
                "comment_body": "It was a few years after I graduated, but a student baked cookies for their entire history class and handed them out one day. Several days later, the student informed everyone that she had actually baked her recent grandfather's ashes into the cookies, and so everyone had eaten some of her dead grandpa. A lot of folks just thought it was a bizarre stunt until some of the cookies that hadn't been eaten were sent to the local PD for testing, and sure enough, contained human remains.   \n\n\nI was in college and was seeing headlines about the school because it was briefly international news I think, and had to text some of my friends that still had younger siblings at the school so I could find out what happened.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id7vn45/",
                "comment_id": "id7vn45"
            },
            {
                "comment_body": "My sister's form teacher got a student pregnant... I mean he did end up \"leaving\" but there's still multiple rumours of him being in prison",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id72wyp/",
                "comment_id": "id72wyp"
            },
            {
                "comment_body": "Biology teacher was having an affair with the principal.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id73cuo/",
                "comment_id": "id73cuo"
            },
            {
                "comment_body": "That the 60 year old art teacher was giving private nude drawing art lessons to a few select students.  Basically she was posing nude for drawing classes and making sweet sweet love to her favorite introverted art students every year.  This went on for a decade that I know of.  When she was 63 she married a 21 year old former student.",
                "comment_url": "/r/AskReddit/comments/vhgh0z/what_was_the_big_rumour_in_your_high_school_did/id7ti9w/",
                "comment_id": "id7ti9w"
            }
        ]
    },
    {
        "thread_url": "http://reddit.com/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/",
        "thread_title": "What would be the worst thing to put into a pinata?",
        "comments": [
            {
                "comment_body": "Amazonian Fire Ants would be a scream!",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7kwcw/",
                "comment_id": "id7kwcw"
            },
            {
                "comment_body": "divorce papers",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7pu7j/",
                "comment_id": "id7pu7j"
            },
            {
                "comment_body": "Scorpions",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7lsyy/",
                "comment_id": "id7lsyy"
            },
            {
                "comment_body": "Bees.",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7k1tu/",
                "comment_id": "id7k1tu"
            },
            {
                "comment_body": "Grandma",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7k4a0/",
                "comment_id": "id7k4a0"
            },
            {
                "comment_body": "Nothing.\n\nTrue story: When my wife was married to her first husband and the kids were little, she bought a pinata at Safeway for her daughter's 8th birthday. The day of the party arrives, and she has her husband hang the pinata in a tree and the kids go after it, blindfolded, with baseball bats, etc. \n\nThey fucking destroy the thing, and are very disappointed when...nothing comes out. My wife had not put the candy inside, thinking the pinata comes already filled. \n\nShe still gets teased about this; our daughter is now 44. \n\n\"Riiiiight mom,\" goes the saying. \"It was filled with *magical* Mexican candy...\"",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7vbmr/",
                "comment_id": "id7vbmr"
            },
            {
                "comment_body": "Spray Each 'player' with water mist then fill Pinata w STRIPPER GLITTER...The small flecks where no matter how hard you flick away, like a piece of cactus, gets stuck somewhere else. LOL",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7kkom/",
                "comment_id": "id7kkom"
            },
            {
                "comment_body": "Any sort of impact based explosive decice.",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7puge/",
                "comment_id": "id7puge"
            },
            {
                "comment_body": "Nitroglycerin.",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7kwhl/",
                "comment_id": "id7kwhl"
            },
            {
                "comment_body": "Another Pinata",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7ju3f/",
                "comment_id": "id7ju3f"
            },
            {
                "comment_body": "Homework.",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7mbj5/",
                "comment_id": "id7mbj5"
            },
            {
                "comment_body": "Those annoying pamphlets disguised as money that tell you to go to church.",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id89a9q/",
                "comment_id": "id89a9q"
            },
            {
                "comment_body": "Milk I feel like is objectively an awful option. Especially for an outdoor piñata. just like, spoiling in the hot sun. it breaks open. everyone gets splashed by milk.",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id8fe7i/",
                "comment_id": "id8fe7i"
            },
            {
                "comment_body": "A huge spider’s nest with every spider dressed up like a piñata",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7k4ru/",
                "comment_id": "id7k4ru"
            },
            {
                "comment_body": "The animal that the pinata is modeled after",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7k4le/",
                "comment_id": "id7k4le"
            },
            {
                "comment_body": "M&Ms mixed with Skittles.",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7sovt/",
                "comment_id": "id7sovt"
            },
            {
                "comment_body": "Not the worse thing - but I worked at a water park that hosted birthday parties. We didn't typically allow pinatas because our party area was outside, and we didn't want any remanents of confetti or candy wrappers to blow into our pools. \n\nWe decided to make an exception because it was a particularly wind-less day, and the birthday child was really excited to have a pinata. We kept the pinata stored inside, so that any candy wouldn't be too melted in the sun. When the party started, we hung it up on a tree branch for the kids.\n\nWell, it turns out that he was excited, not for candy, but to see the look on his peers' faces when SPINACH came out of the pinata. Not bagged spinach btw - several bags worth of instantly cooked from the sun, wilted spinach, that began to instantly stick to and stain the concrete once it fell to the ground.\n\nObviously, the children didn't rush to pick the spinach up, so I had to scrape spinach off of the concrete before the next birthday party.",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id8cgcm/",
                "comment_id": "id8cgcm"
            },
            {
                "comment_body": "Lots and lots of hot sauce",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7m29v/",
                "comment_id": "id7m29v"
            },
            {
                "comment_body": "Knives",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7k1u4/",
                "comment_id": "id7k1u4"
            },
            {
                "comment_body": "Sarin",
                "comment_url": "/r/AskReddit/comments/vhjnsu/what_would_be_the_worst_thing_to_put_into_a_pinata/id7kwl0/",
                "comment_id": "id7kwl0"
            }
        ]
    }
]